[
  {"doc_id": "D1", "text": "Information retrieval is the process of obtaining relevant data from a collection of documents."},
  {"doc_id": "D2", "text": "Natural language processing helps computers understand human text."},
  {"doc_id": "D3", "text": "The VSM model uses vector representation for documents and queries."},
  {"doc_id": "D4", "text": "BM25 is a probabilistic model for effective information retrieval."},
  {"doc_id": "D5", "text": "Text preprocessing includes tokenization, stopword removal, and stemming."},
  {"doc_id": "D6", "text": "Stopwords are frequently occurring words that carry little meaning."},
  {"doc_id": "D7", "text": "Stemming converts words to their base form to facilitate matching."},
  {"doc_id": "D8", "text": "TF-IDF measures the importance of a word in a document and the collection."},
  {"doc_id": "D9", "text": "Model evaluation uses precision, recall, and F1-score."},
  {"doc_id": "D10", "text": "A query is user input to find relevant documents."},
  {"doc_id": "D11", "text": "An index enables fast searching within a large document collection."},
  {"doc_id": "D12", "text": "Tokenization breaks text into words or tokens."},
  {"doc_id": "D13", "text": "Ranking documents based on relevance scores is crucial."},
  {"doc_id": "D14", "text": "Public datasets are often used for IR model benchmarking."},
  {"doc_id": "D15", "text": "Natural Language Processing is used in chatbots and sentiment analysis."},
  {"doc_id": "D16", "text": "Understanding queries helps improve search quality."},
  {"doc_id": "D17", "text": "Machine learning can also be used in information retrieval."},
  {"doc_id": "D18", "text": "The BM25 algorithm is based on the probability of document relevance."},
  {"doc_id": "D19", "text": "VSM treats documents as points in a high-dimensional space."},
  {"doc_id": "D20", "text": "Stopword removal reduces noise in text data."},
  {"doc_id": "D21", "text": "A corpus is a collection of documents for research or training."},
  {"doc_id": "D22", "text": "Text analysis helps extract important information."},
  {"doc_id": "D23", "text": "Boolean search uses the AND, OR, and NOT operators."},
  {"doc_id": "D24", "text": "Inverted indexing speeds up word search in documents."},
  {"doc_id": "D25", "text": "Query expansion improves search results using synonyms."},
  {"doc_id": "D26", "text": "Modern IR systems use a combination of statistical models and ML."},
  {"doc_id": "D27", "text": "Model performance evaluation helps choose the best algorithm."},
  {"doc_id": "D28", "text": "Precision shows the proportion of relevant results among retrieved results."},
  {"doc_id": "D29", "text": "Recall measures how many relevant documents are found."},
  {"doc_id": "D30", "text": "F1-score is the harmonic mean of precision and recall."}
]
